
# განმარტებები

# String (str) — ტექსტი, რომელიც ყოველთვის ჩაწერილია ბრჭყალებში. (მაგ: "მარიამი").
# Integer (int) — მთელი რიცხვები, რომლებიც არ შეიცავენ წილადებს. (მაგალითად: 15, 23, -5). age = 15  # integer

# Boolean (bool) — ტიპი, რომელიც მხოლოდ ორი მნიშვნელობა ფლობს: True ან False. is_active = True  # boolean
# Float (float) — რიცხვები, რომლებიც შეიცავენ წილადებს (ანუ მათ აქვთ მიკრო ნაწილი, მაგალითად 2.5).


# განსხვავებები

# String vs Integer:

# String არის ტექსტური მონაცემი, რომელიც ყოველთვის ჩაწერილია ბრჭყალებში, Integer არის მთელი რიცხვი, რომელიც არ საჭიროებს ბრჭყალებს.
# String: "მარიამი", Integer: 15

# Boolean vs String:

# Boolean-ის მხოლოდ ორი შესაძლო მნიშვნელობა არსებობს: True ან False, რომელიც გამოიყენება ლოგიკური ოპერაციებისათვის. String კი წარმოადგენს ნებისმიერი ტექსტურ მონაცემებს.
# Boolean: True, False; String: "მარიამი"

# Float vs Integer:

# Float არის რიცხვი, რომელიც შეიცავს წილებს (წერტილს), მაშინ როდესაც Integer არის რიცხვი, რომელიც არ შეიცავს წილებს.
# Float: 2.5, 0.75; Integer: 3, -5

# Boolean vs Integer

# Boolean ტიპი შეიძლება იყოს მხოლოდ True ან False.
# Integer ტიპი კი შეიძლება იყოს ნებისმიერი მთელი რიცხვი.
# მაგალითად: True, False - boolean. # 25, -10, 0 - integer

