# მეტობა
# 10 მეტი 5-ზე, შედეგი უნდა იყოს True.
# 10 > 5
print(10 > 5)  # True

# ნაკლებობა
# 3 ნაკლებია 7-ზე, შედეგი უნდა იყოს True.
# 3 < 7
print(3 < 7)  # True

# 3) - მეტობა თუ ტოლობა
# 5 მეტია ან ტოლია 5-თან, შედეგი უნდა იყოს True.
# 5 >= 5
print(5 >= 5)  # True

# 4) - ნაკლებობა თუ ტოლობა
# 2 ნაკლებია ან ტოლობა 3-თან, შედეგი უნდა იყოს True.
# 2 <= 3
print(2 <= 3)  # True

# 5) - ტოლობა
# 4 ტოლია 4-თან, შედეგი უნდა იყოს True.
# 4 == 4
print(4 == 4)  # True

# Python-ის შედარებები გვიბრუნებს მხოლოდ True ან False იმიტომ, რომ ისინი არიან ლოგიკური შეფასების შედეგები, 
# რომელიც მხოლოდ ორ შესაძლო მნიშვნელობას გამოგვიტანს ტერმინალში: True (სიმართლე) ან False (ტყუილი).